{"company_name": "APOLLOHOSP LTD", "extracted_text": "Based on web searches, here's a summary of significant corporate developments and business updates for APOLLOHOSP Ltd on August 22, 2025:\n\nExclusion of Routine Information:\n\nNote that routine market commentary, price movements, and other non-material information, such as daily stock fluctuations and general market trends, have been excluded from this summary to focus solely on substantial corporate developments.\n\nPromoter Stake Sale via Block Deal:Suneetha Reddy, a promoter of Apollo Hospitals Enterprise, sold a stake worth ₹1,489 crore through a block deal. This transaction involved the sale of 18.97 lakh shares at ₹7,850 per share, representing approximately 1.32% of the company's equity.\n\nStrong Q1 FY26 Results:This stake sale occurred following Apollo Hospitals' announcement of strong financial results for Q1 FY26. The company reported a 42% year-on-year increase in net profit, reaching ₹433 crore. Revenue from operations also grew by 15%, reaching ₹5,842 crore.\n\nPositive Investor Response:The block deal attracted significant interest from both foreign and domestic institutional investors.The Economic Timesreported that buyers included the Abu Dhabi Investment Authority, T. Rowe Price, Kotak Mahindra Life Insurance, and Axis Mutual Fund.\n\nSpecial Window for Physical Share Transfers:Apollo Hospitals announced a special window for re-lodgement of transfer requests for physical shares.", "links_raw": "1. https://economictimes.indiatimes.com/apollo-hospitals-enterprise-ltd/stocksupdate/companyid-62.cms#:~:text=Apollo%20Hospitals%20Enterprise%20News%20%2D%20Apollo,Hospitals%20Enterprise%20%2D%20The%20Economic%20Times\n2. https://www.angelone.in/news/market-updates/apollo-hospitals-share-price-rises-6-percent-sees-pat-jump-in-q1-fy26-results", "processed_links": ["https://1. https://economictimes.indiatimes.com/apollo-hospitals-enterprise-ltd/stocksupdate/companyid-62.cms#:~:text=Apollo%20Hospitals%20Enterprise%20News%20%2D%20Apollo", "https://Hospitals%20Enterprise%20%2D%20The%20Economic%20Times\n2. https://www.angelone.in/news/market-updates/apollo-hospitals-share-price-rises-6-percent-sees-pat-jump-in-q1-fy26-results"], "date": "2025-08-22"}